app/controllers/todos_controller.rb

	def index
		@todo = Todo.new
		@todos = Todo.all
---
SELECT "todos".* FROM "todos"

	def create
		@todo =Todo.new(todo_params)
		if  @todo.save
---
INSERT INTO "todos" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "吃飯"], ["created_at", "2015-05-23 14:34:07.230510"], ["updated_at", "2015-05-23 14:34:07.230510"]]

	def update
		if @todo.update(todo_params)
---
UPDATE "todos" SET "content" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["content", "吃早飯"], ["updated_at", "2015-05-24 03:27:00.676145"], ["id", 1]]

	def find_todo
		@todo = Todo.find(params[ :id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 3]]